Here, we will solve problems two ways
1. First using PySpark function 
2. Second using Spark SQL

In [1]:
# First Load all the required library and also Start Spark Session
# Load all the required library
from pyspark.sql import SparkSession

In [2]:
#Start Spark Session
spark = SparkSession.builder.appName("problem1").getOrCreate()
sqlContext = SparkSession(spark)
#Dont Show warning only error
spark.sparkContext.setLogLevel("ERROR")

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/opt/spark/jars/spark-unsafe_2.12-3.2.1.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/02/03 10:13:11 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [17]:
#Load CSV file into DataFrame
employeedf = spark.read.format("csv").option("header","true").option("inferSchema","true").load("employee.csv")

In [18]:
#Check Schema of DataFrame
employeedf.printSchema()

root
 |-- id: integer (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- department_id: integer (nullable = true)

In [19]:
#Check sample Data 
employeedf.show()

+---+----------+---------+------+-------------+
| id|first_name|last_name|salary|department_id|
+---+----------+---------+------+-------------+
|  1|      Todd|   Wilson|110000|         1006|
|  1|      Todd|   Wilson|106119|         1006|
|  2|    Justin|    Simon|128922|         1005|
|  2|    Justin|    Simon|130000|         1005|
|  3|     Kelly|  Rosario| 42689|         1002|
|  4|  Patricia|   Powell|162825|         1004|
|  4|  Patricia|   Powell|170000|         1004|
|  5|    Sherry|   Golden| 44101|         1002|
|  6|   Natasha|  Swanson| 79632|         1005|
|  6|   Natasha|  Swanson| 90000|         1005|
|  7|     Diane|   Gordon| 74591|         1002|
|  8|  Mercedes|Rodriguez| 61048|         1005|
|  9|   Christy| Mitchell|137236|         1001|
|  9|   Christy| Mitchell|140000|         1001|
|  9|   Christy| Mitchell|150000|         1001|
| 10|      Sean| Crawford|182065|         1006|
| 10|      Sean| Crawford|190000|         1006|
| 11|     Kevin| Townsend|166861|         1002|
| 12|    Joshua|  Johnson|123082|         1004|
| 13|     Julie|  Sanchez|185663|         1001|
+---+----------+---------+------+-------------+
only showing top 20 rows

In [20]:
#Checking number of rows in dataframe
employeedf.count()

95

In [28]:
#Solving Problem using PySpark 
# 1. We need to print latest salary of each employee
# 2. We also need their id, first name, lastname, department id and latest salary 
# 3. We also want to order by it by id 

# On a first step we are just getting all the columns and doing order by 

employeedf.select("id","first_name","last_name","department_id","salary").orderBy("id").show()

+---+----------+---------+-------------+------+
| id|first_name|last_name|department_id|salary|
+---+----------+---------+-------------+------+
|  1|      Todd|   Wilson|         1006|110000|
|  1|      Todd|   Wilson|         1006|106119|
|  2|    Justin|    Simon|         1005|128922|
|  2|    Justin|    Simon|         1005|130000|
|  3|     Kelly|  Rosario|         1002| 42689|
|  4|  Patricia|   Powell|         1004|170000|
|  4|  Patricia|   Powell|         1004|162825|
|  5|    Sherry|   Golden|         1002| 44101|
|  6|   Natasha|  Swanson|         1005| 79632|
|  6|   Natasha|  Swanson|         1005| 90000|
|  7|     Diane|   Gordon|         1002| 74591|
|  8|  Mercedes|Rodriguez|         1005| 61048|
|  9|   Christy| Mitchell|         1001|140000|
|  9|   Christy| Mitchell|         1001|150000|
|  9|   Christy| Mitchell|         1001|137236|
| 10|      Sean| Crawford|         1006|182065|
| 10|      Sean| Crawford|         1006|190000|
| 11|     Kevin| Townsend|         1002|166861|
| 12|    Joshua|  Johnson|         1004|123082|
| 13|     Julie|  Sanchez|         1001|185663|
+---+----------+---------+-------------+------+
only showing top 20 rows

In [33]:
# Now we will use group by function and get max salary for each employee 
employeedf.groupBy("id","first_name","last_name","department_id").max("salary").orderBy("id").show(n=100)
# We can also store result into dataframe
finaldf = employeedf.groupBy("id","first_name","last_name","department_id").max("salary").orderBy("id")

+---+----------+---------+-------------+-----------+
| id|first_name|last_name|department_id|max(salary)|
+---+----------+---------+-------------+-----------+
|  1|      Todd|   Wilson|         1006|     110000|
|  2|    Justin|    Simon|         1005|     130000|
|  3|     Kelly|  Rosario|         1002|      42689|
|  4|  Patricia|   Powell|         1004|     170000|
|  5|    Sherry|   Golden|         1002|      44101|
|  6|   Natasha|  Swanson|         1005|      90000|
|  7|     Diane|   Gordon|         1002|      74591|
|  8|  Mercedes|Rodriguez|         1005|      61048|
|  9|   Christy| Mitchell|         1001|     150000|
| 10|      Sean| Crawford|         1006|     190000|
| 11|     Kevin| Townsend|         1002|     166861|
| 12|    Joshua|  Johnson|         1004|     123082|
| 13|     Julie|  Sanchez|         1001|     210000|
| 14|      John|  Coleman|         1001|     152434|
| 15|   Anthony|   Valdez|         1001|      96898|
| 16|    Briana|    Rivas|         1005|     151668|
| 17|     Jason|  Burnett|         1006|      42525|
| 18|   Jeffrey|   Harris|         1002|      20000|
| 19|   Michael|   Ramsey|         1003|      63159|
| 20|      Cody| Gonzalez|         1004|     112809|
| 21|   Stephen|    Berry|         1002|     123617|
| 22|  Brittany|    Scott|         1002|     162537|
| 23|    Angela| Williams|         1004|     100875|
| 24|   William|   Flores|         1003|     142674|
| 25|    Pamela| Matthews|         1005|      57944|
| 26|   Allison|  Johnson|         1001|     128782|
| 27|   Anthony|     Ball|         1003|      34386|
| 28|    Alexis|     Beck|         1005|      12260|
| 29|     Jason|    Olsen|         1006|      51937|
| 30|   Stephen|    Smith|         1001|     194791|
| 31|  Kimberly|   Brooks|         1003|      95327|
| 32|      Eric|Zimmerman|         1006|      83093|
| 33|     Peter|     Holt|         1002|      69945|
| 34|    Justin|     Dunn|         1003|      67992|
| 35|      John|     Ball|         1004|      47795|
| 36|     Jesus|     Ward|         1005|      36078|
| 37|    Philip|Gillespie|         1006|      36424|
| 38|    Nicole|    Lewis|         1001|     114079|
| 39|     Linda|    Clark|         1002|     186781|
| 40|   Colleen| Carrillo|         1004|     147723|
| 41|      John|   George|         1001|      21642|
| 42|     Traci| Williams|         1003|     180000|
| 43|    Joseph|   Rogers|         1005|      22800|
| 44|    Trevor|   Carter|         1001|      38670|
| 45|     Kevin|   Duncan|         1003|      45210|
| 46|    Joshua|    Ewing|         1003|      73088|
| 47|  Kimberly|     Dean|         1003|      71416|
| 48|    Robert|    Lynch|         1004|     117960|
| 49|     Amber|  Harding|         1002|      77764|
| 50|  Victoria|   Wilson|         1002|     176620|
| 51|   Theresa|  Everett|         1002|      31404|
| 52|      Kara|    Smith|         1004|     192838|
| 53|    Teresa|    Cohen|         1001|      98860|
| 54|    Wesley|   Tucker|         1005|      90221|
| 55|   Michael|   Morris|         1005|     106799|
| 56|   Rachael| Williams|         1002|     103585|
| 57|  Patricia|   Harmon|         1005|     147417|
| 58|    Edward|    Sharp|         1005|      41077|
| 59|     Kevin| Robinson|         1005|     100924|
| 60|   Charles|  Pearson|         1004|     173317|
| 61|      Ryan|    Brown|         1003|     120000|
| 62|      Dale|    Hayes|         1005|      97662|
| 63|   Richard|  Sanford|         1001|     136083|
| 64|  Danielle| Williams|         1006|     120000|
| 65|   Deborah|   Martin|         1004|      67389|
| 66|    Dustin|     Bush|         1004|      47567|
| 67|     Tyler|    Green|         1002|     111085|
| 68|   Antonio|Carpenter|         1002|      83684|
| 69|    Ernest| Peterson|         1005|     115993|
| 70|     Karen|Fernandez|         1003|     101238|
| 71|  Kristine|    Casey|         1003|      67651|
| 72| Christine|     Frye|         1004|     137244|
| 73|   William|  Preston|         1003|     155225|
| 74|   Richard|     Cole|         1003|     180361|
| 75|     Julia|    Ramos|         1006|     105000|
+---+----------+---------+-------------+-----------+

In [34]:
# Final result into final dataframe
finaldf.count()

75

In [35]:
# Now we are solving Same problem using Spark SQL 
# Creating Temp Table or HIVE table
employeedf.createOrReplaceTempView("tmpEmployee")

In [36]:
# Now we have SQL Table and we can write SQL Query on top of that 
# For example by Select on table 
sqlContext.sql("SELECT * FROM tmpEmployee").show()

+---+----------+---------+------+-------------+
| id|first_name|last_name|salary|department_id|
+---+----------+---------+------+-------------+
|  1|      Todd|   Wilson|110000|         1006|
|  1|      Todd|   Wilson|106119|         1006|
|  2|    Justin|    Simon|128922|         1005|
|  2|    Justin|    Simon|130000|         1005|
|  3|     Kelly|  Rosario| 42689|         1002|
|  4|  Patricia|   Powell|162825|         1004|
|  4|  Patricia|   Powell|170000|         1004|
|  5|    Sherry|   Golden| 44101|         1002|
|  6|   Natasha|  Swanson| 79632|         1005|
|  6|   Natasha|  Swanson| 90000|         1005|
|  7|     Diane|   Gordon| 74591|         1002|
|  8|  Mercedes|Rodriguez| 61048|         1005|
|  9|   Christy| Mitchell|137236|         1001|
|  9|   Christy| Mitchell|140000|         1001|
|  9|   Christy| Mitchell|150000|         1001|
| 10|      Sean| Crawford|182065|         1006|
| 10|      Sean| Crawford|190000|         1006|
| 11|     Kevin| Townsend|166861|         1002|
| 12|    Joshua|  Johnson|123082|         1004|
| 13|     Julie|  Sanchez|185663|         1001|
+---+----------+---------+------+-------------+
only showing top 20 rows

In [38]:
# Now we will write query to get max salary for each employee 
# so we will use SQL Group by and SQL Order by functions 
sqlContext.sql("SELECT id,first_name,last_name,MAX(salary) AS LatesSalary,department_id \
                       FROM tmpEmployee \
                       GROUP BY id,first_name,last_name,department_id \
                       ORDER BY id").show(n=100)

+---+----------+---------+-----------+-------------+
| id|first_name|last_name|LatesSalary|department_id|
+---+----------+---------+-----------+-------------+
|  1|      Todd|   Wilson|     110000|         1006|
|  2|    Justin|    Simon|     130000|         1005|
|  3|     Kelly|  Rosario|      42689|         1002|
|  4|  Patricia|   Powell|     170000|         1004|
|  5|    Sherry|   Golden|      44101|         1002|
|  6|   Natasha|  Swanson|      90000|         1005|
|  7|     Diane|   Gordon|      74591|         1002|
|  8|  Mercedes|Rodriguez|      61048|         1005|
|  9|   Christy| Mitchell|     150000|         1001|
| 10|      Sean| Crawford|     190000|         1006|
| 11|     Kevin| Townsend|     166861|         1002|
| 12|    Joshua|  Johnson|     123082|         1004|
| 13|     Julie|  Sanchez|     210000|         1001|
| 14|      John|  Coleman|     152434|         1001|
| 15|   Anthony|   Valdez|      96898|         1001|
| 16|    Briana|    Rivas|     151668|         1005|
| 17|     Jason|  Burnett|      42525|         1006|
| 18|   Jeffrey|   Harris|      20000|         1002|
| 19|   Michael|   Ramsey|      63159|         1003|
| 20|      Cody| Gonzalez|     112809|         1004|
| 21|   Stephen|    Berry|     123617|         1002|
| 22|  Brittany|    Scott|     162537|         1002|
| 23|    Angela| Williams|     100875|         1004|
| 24|   William|   Flores|     142674|         1003|
| 25|    Pamela| Matthews|      57944|         1005|
| 26|   Allison|  Johnson|     128782|         1001|
| 27|   Anthony|     Ball|      34386|         1003|
| 28|    Alexis|     Beck|      12260|         1005|
| 29|     Jason|    Olsen|      51937|         1006|
| 30|   Stephen|    Smith|     194791|         1001|
| 31|  Kimberly|   Brooks|      95327|         1003|
| 32|      Eric|Zimmerman|      83093|         1006|
| 33|     Peter|     Holt|      69945|         1002|
| 34|    Justin|     Dunn|      67992|         1003|
| 35|      John|     Ball|      47795|         1004|
| 36|     Jesus|     Ward|      36078|         1005|
| 37|    Philip|Gillespie|      36424|         1006|
| 38|    Nicole|    Lewis|     114079|         1001|
| 39|     Linda|    Clark|     186781|         1002|
| 40|   Colleen| Carrillo|     147723|         1004|
| 41|      John|   George|      21642|         1001|
| 42|     Traci| Williams|     180000|         1003|
| 43|    Joseph|   Rogers|      22800|         1005|
| 44|    Trevor|   Carter|      38670|         1001|
| 45|     Kevin|   Duncan|      45210|         1003|
| 46|    Joshua|    Ewing|      73088|         1003|
| 47|  Kimberly|     Dean|      71416|         1003|
| 48|    Robert|    Lynch|     117960|         1004|
| 49|     Amber|  Harding|      77764|         1002|
| 50|  Victoria|   Wilson|     176620|         1002|
| 51|   Theresa|  Everett|      31404|         1002|
| 52|      Kara|    Smith|     192838|         1004|
| 53|    Teresa|    Cohen|      98860|         1001|
| 54|    Wesley|   Tucker|      90221|         1005|
| 55|   Michael|   Morris|     106799|         1005|
| 56|   Rachael| Williams|     103585|         1002|
| 57|  Patricia|   Harmon|     147417|         1005|
| 58|    Edward|    Sharp|      41077|         1005|
| 59|     Kevin| Robinson|     100924|         1005|
| 60|   Charles|  Pearson|     173317|         1004|
| 61|      Ryan|    Brown|     120000|         1003|
| 62|      Dale|    Hayes|      97662|         1005|
| 63|   Richard|  Sanford|     136083|         1001|
| 64|  Danielle| Williams|     120000|         1006|
| 65|   Deborah|   Martin|      67389|         1004|
| 66|    Dustin|     Bush|      47567|         1004|
| 67|     Tyler|    Green|     111085|         1002|
| 68|   Antonio|Carpenter|      83684|         1002|
| 69|    Ernest| Peterson|     115993|         1005|
| 70|     Karen|Fernandez|     101238|         1003|
| 71|  Kristine|    Casey|      67651|         1003|
| 72| Christine|     Frye|     137244|         1004|
| 73|   William|  Preston|     155225|         1003|
| 74|   Richard|     Cole|     180361|         1003|
| 75|     Julia|    Ramos|     105000|         1006|
+---+----------+---------+-----------+-------------+